#include <PR/ultratypes.h>
#include <PR/os.h>
#include <PR/sptask.h>
#include <PR/rcp.h>
#include <missing_libultra.h>
#include <macros.h>
#include <ssb_types.h>

#include "sys/main.h"
#include "sys/thread3.h"
#include "sys/system.h"

struct MqListNode {
    /* 0x00 */ struct MqListNode *next;
    /* 0x04 */ OSMesgQueue *mq;
};

struct SpMqInfo {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ struct SpTaskQueue *unk0C; // next; should these point to the combined type, or just this info type?
    /* 0x10 */ struct SpTaskQueue *unk10; // prev
    /* 0x14 */ s32 (*func)(struct SpTaskQueue *);
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ OSMesgQueue *unk20;
    /* 0x24 */ struct MqListNode *unk24; // checked type? (-1 is meaningful)
};

struct SpTaskQueue {
    /* 0x00 */ struct SpMqInfo info;
    /* 0x28 */ OSTask task;
    /* 0x68 */ s32 *unk68;
    /* 0x6C */ s32 *unk6C; // checked type? (-1 is meaningful)
    /* 0x70 */ u8 pad70[0x04];
    /* 0x74 */ s32 unk74;
    /* 0x78 */ s32 unk78;
    /* 0x7C */ s32 unk7C;
    /* 0x80 */ u32 unk80;
};

/*
	28 00 u32	type;
	2C 04 u32	flags;
	30 08 u64	*ucode_boot;
	34 0c u32	ucode_boot_size;

	38 10 u64	*ucode;
	3c 14 u32	ucode_size;
	40 18 u64	*ucode_data;
	44 1c u32	ucode_data_size;

	48 20 u64	*dram_stack;
	4c 24 u32	dram_stack_size;
	50 28 u64	*output_buff;
	54 2c u64	*output_buff_size;

	58 30 u64	*data_ptr;
	5c 34 u32	data_size;
	60 38 u64	*yield_data_ptr;
	64 3c u32	yield_data_size;
*/

union CheckedPtr {
    void *ptr;
    intptr_t tag;
};

struct ViSettings {
    u8 unk_b80 : 1;       // b0 0 80 => unknown game control (arg2 & 0x1) [aa & resamp enabled?]
    u8 serrate : 1;       // b1 0 40 => serrate enabled (bool)
    u8 pixelSize32 : 1;   // b2   20 => type_32 enabled
    u8 gamma : 1;         // b3   10 => gamma on
    u8 blackout : 1;      // b4   08 => unknown game control (arg2 & 0x100) [blackout ?]
    u8 unk_b04 : 1;       // b5   04 => unknown game control (arg2 & 0x400)
    u8 gamma_dither : 1;  // b6   02 => gamma dither on
    u8 dither_filter : 1; // b7   01 => dither filter
    u8 divot : 1;         // b8 1 80 => divot on
                          // b9 1 40 
};




// bss
struct MqListNode *D_80044EC0;
struct SpTaskQueue *D_80044EC4;
struct SpTaskQueue *D_80044EC8;
struct SpTaskQueue *D_80044ECC;
struct SpTaskQueue *D_80044ED0;
struct SpTaskQueue *D_80044ED4;
struct SpTaskQueue *D_80044ED8;
struct SpTaskQueue *D_80044EDC;
struct SpTaskQueue *D_80044EE0;
struct SpTaskQueue *D_80044EE4;
OSViMode D_80044EE8;
OSViMode D_80044F38;
u32 D_80044F88[2];
void *D_80044F90[3];
void *D_80044F9C;
void *D_80044FA0;
u32 D_80044FA4;
void *D_80044FA8;
u32 D_80044FAC;
u32 D_80044FB0;
u32 D_80044FB4;
u32 D_80044FB8;
struct ViSettings D_80044FBC; //bitflags? union?
s64 D_80044FC0;
s32 *D_80044FC8;
u32 D_80044FCC; //index into D_80044FC8?
u32 D_80044FD0; // unknown
u8 unref_80044FD4[4];
OSMesg D_80044FD8[8];
OSMesgQueue gScheduleTaskQueue;
u32 D_80045010;
OSMesgQueue *D_80045014;
void (*D_80045018)(void);
s32 D_8004501C;
s32 D_80045020;
s32 D_80045024; // return of osAfterPreNMI
void *D_80045028[3];
u8 D_80045034;
u8 D_80045035;
u8 extend_D_80045036;
u8 extend_D_80045037;
u8 extend_D_80045038[8];


#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunknown-pragmas"

void func_80000920(s32 val) {
    D_8004501C = val;
}

s32 func_8000092C(void) {
    return D_8004501C;
}

void unref_80000938(void) {
    struct SpTaskQueue *i = D_80044ECC, *j = D_80044EE4, *k = D_80044EDC;
    
    do {

    } while ( i || j || k );
}

void func_80000970(struct SpMqInfo *arg0) {
    OSMesg msgs[1];
    OSMesgQueue mq;

    osCreateMesgQueue(&mq, msgs, ARRAY_COUNT(msgs));
    arg0->func = NULL;
    arg0->unk1C = 1;
    arg0->unk20 = &mq;
    osSendMesg(&gScheduleTaskQueue, (OSMesg)arg0, OS_MESG_NOBLOCK);
    osRecvMesg(&mq, NULL, OS_MESG_BLOCK);
}

void func_800009D8(struct MqListNode *arg0, OSMesgQueue *mq, OSMesg *msg, u32 count) {
    struct SpMqInfo sp18;
    
    osCreateMesgQueue(mq, msg, count);
    arg0->mq = mq;
    sp18.unk00 = 3;
    sp18.unk04 = 100;
    sp18.unk24 = arg0;
    func_80000970(&sp18);
}

struct Unk80000A34 {
    /* 0x00 */ u8 pad00[0x70];
    /* 0x70 */ s32 unk70;
};


#ifdef NON_MATCHING
s32 unref_80000A34(struct Unk80000A34 *arg0) {
    void *nextFb; //1c
    void *tempA0_2;
    void *curFb; // temp_v0
    void *tempA0; // a0
    s32 i; // a0_2]

    if (!D_80044F9C) {
        return 1;
    } 
    if (!D_80044FA0) {
        return 0;
    }

    nextFb = osViGetNextFramebuffer();
    curFb = osViGetCurrentFramebuffer();

    if (arg0->unk70 != -1) {
        tempA0 = D_80044F90[arg0->unk70];
        if (tempA0 && tempA0 != curFb && tempA0 != nextFb) {
            D_80044F9C = tempA0;
            D_80044FA0 = tempA0;
            D_80044FC8 = 0;
            D_80044FAC = osGetCount();

            return 1;
        } // L80000AE8

        for (i = 0; i < ARRAY_COUNT(D_80044F90); i++) {
            tempA0_2 = D_80044F90[i];
            if (tempA0_2 && tempA0_2 != curFb && tempA0_2 != nextFb) {
                D_80044F9C = tempA0_2;
                D_80044FC8 = 0;
                D_80044FAC = osGetCount();
